tutorials/basic/simpleFoam/3D/Sphere_Unit_Cell/Velocity_Y_Direction/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         250;

deltaT          1;

writeControl    timeStep;

writeInterval   250;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


// ************************************************************************* //

functions {
  volFieldValue1
  {
    type            volFieldValue;
    libs ("libfieldFunctionObjects.so");
    enabled         true;
    writeControl    timeStep;
    writeInterval   250;
    log             true;
    writeFields     true;
    regionType      cellZone;
    name            domain;
    operation       volAverage;
    fields
    (
        U
    );
  }
}
